---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintCircumference
source: html/b211f82e-b1cf-13b8-24e1-725f2b867f30.htm
---
# RebarShapeConstraintCircumference Properties

The choice of rule for measuring the diameter.